luanxg/RTL8720-SDK/project/realtek_amebaD_cm4_gcc_verification/example_sources/LCDC/GUI_demo/uCGUI_RGB16/src/demo_code/rt_gui_demo_includes.h

#ifndef RT_GUI_DEMO_INCLUDES_H
#define RT_GUI_DEMO_INCLUDES_H

typedef struct RT_CUS_DEMO_STS{
		s32 TransSts;
} RT_CUS_DEMO_STS_TYPE;

extern unsigned int  RtCusLanguage;

#define RT_CUS_ENGLISH     0
#define RT_CUS_CHINESE     1

#include "platform_stdlib.h"
#include "basic_types.h"
#include "diag.h"
#include "rand.h"
#include "section_config.h"
#include "ameba_soc.h"
//#include "rtl8721d_lcdc_test.h"
#include "rtl8721d_lcdc.h"
//#include "bsp_mcu_lcd.h"
#include "bsp_rgb_lcd.h"
//#include "bsp_led_board.h"
#include "gt9147.h"
#include "touch.h"
#include "ctiic.h"


#include "picture_inc.h"
#include "gui_cus_parts.h"
#include "main_menu.h"
#include "start_menu.h"
#include "realtek_demo.h"
#include "tempre_menu.h"
#include "grad_menu.h"
#include "light_menu.h"
#include "wave_menu.h"
#include "clock_menu.h"

#define countof(Obj) (sizeof(Obj)/sizeof(Obj[0]))

#define RT_DEFAULT_COLOR    0xBB6F24
#define NULL   0

#endif /* LCDCONF_H */

	 	 			 		    	 				 	  			   	 	 	 	 	 	  	  	      	   		 	 	 		  		  	 		 	  	  			     			       	   	 			  		    	 	     	 				  	 					 	 			   	  	  			 				 		 	 	 			     			 
		    	 				 	  			   	 	 	 	 	 	  	  	      	   		 	 	 		  		  	 		 	  	  			     			       	   	 			  		    	 	     	 				  	 					 	 			   	  	  			 				 		 	 	 			     			 
